teamjft/NUVOTON-NUC200/NUC200Series_sample/SampleCode/USB/UDC/MassStorage.c
/****************************************************************************
 * @file     MassStorage.c
 * @version  V1.00
 * $Revision: 3 $
 * $Date: 8/07/12 1:23p $ 
 * @brief    NUC200 Series Mass Storage API
 *
 * @note
 * Copyright (C) 2011 Nuvoton Technology Corp. All rights reserved.
 *
 ******************************************************************************/

#include <string.h>
#include "NUC200Series.h"
#include "UDC.h"

#define VENDER_CMD  0x61

//#define TEST_DATA_FLASH

#define DATA_FLASH_STORAGE_SIZE    (64*1024)  /* Configure the DATA FLASH storage size */
#define MASS_BUFFER_SIZE    48                /* Mass Storage command buffer size */
#define STORAGE_BUFFER_SIZE 512               /* Data transfer buffer size in 512 bytes alignment */
#define UDC_SECTOR_SIZE   512               /* logic sector size */

#define VENDOR_ID   0x0416
#define PRODUCT_ID  0x501E

int32_t gTotalSectors = 0;
int32_t g_dataFlashTotalSectors = 0;

uint8_t volatile MassLUN=0;
uint8_t volatile F_DATA_FLASH_LUN = 0xFF;

/* DATA Flash Programming API */
extern void DataFlashRead(uint32_t addr, uint32_t size, uint32_t buffer);
extern void DataFlashWrite(uint32_t addr, uint32_t size, uint32_t buffer);

/* USB flow control variables */
uint8_t g_u8UsbState;
uint8_t g_u8Address;
uint8_t g_u8Config;
uint8_t g_u8Flag;
uint8_t g_u8BulkState;

uint8_t g_au8SenseKey[4];

uint32_t g_u32DataFlashStartAddr;
uint32_t g_u32Address;
uint32_t g_u32Length;
uint32_t g_u32LbaAddress;
uint32_t g_u32BytesInStorageBuf;
uint32_t g_u32OutToggle;  // for Error Detection
uint8_t preventflag=0;
uint8_t g_u8Size;
int32_t g_bCBWInvalid;
int32_t udcOnLine = 0;

/* CBW/CSW variables */
struct CBW g_sCBW;
struct CSW g_sCSW;

uint32_t MassBlock[MASS_BUFFER_SIZE / 4];
uint32_t Storage_Block[STORAGE_BUFFER_SIZE / 4];

#define MassCMD_BUF        ((uint32_t)&MassBlock[0])
#define STORAGE_DATA_BUF   ((uint32_t)&Storage_Block[0])

// code = 5Ah, Mode Sense
static uint8_t ModePage_01[12] = {
  0x01, 0x0A, 0x00, 0x03, 0x00, 0x00, 0x00, 0x00,
  0x03, 0x00, 0x00, 0x00 };

static uint8_t ModePage_05[32] = {
  0x05, 0x1E, 0x13, 0x88, 0x08, 0x20, 0x02, 0x00,
  0x01, 0xF4, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
  0x00, 0x00, 0x00, 0x05, 0x1E, 0x00, 0x00, 0x00,
  0x00, 0x00, 0x00, 0x00, 0x01, 0x68, 0x00, 0x00 };

static uint8_t ModePage_1B[12] = {
  0x1B, 0x0A, 0x00, 0x01, 0x00, 0x00, 0x00, 0x00,
  0x00, 0x00, 0x00, 0x00 };

static uint8_t ModePage_1C[8] = {
  0x1C, 0x06, 0x00, 0x05, 0x00, 0x00, 0x00, 0x00 };

//======================================================
const uint8_t MassDeviceDescriptor[LEN_DEVICE] =
{
  LEN_DEVICE,       // bLength
  DESC_DEVICE,      // bDescriptorType
  0x10, 0x01,       // bcdUSB
  0x00,         // bDeviceClass
  0x00,         // bDeviceSubClass
  0x00,         // bDeviceProtocol
  MAX_PACKET_SIZE0, // bMaxPacketSize0
  (VENDOR_ID & 0xFF), 
  (VENDOR_ID >> 8),   // idVendor
  (PRODUCT_ID & 0xFF), 
  (PRODUCT_ID >> 8),  // idProduct
  0x00, 0x00,       // bcdDevice
  0x01,         // iManufacture
  0x02,         // iProduct
  0x01,         // iSerialNumber
  0x01          // bNumConfigurations
};

const uint8_t MassConfigurationBlock[LEN_CONFIG+LEN_INTERFACE+LEN_ENDPOINT*2] =
{
  LEN_CONFIG,                                         // bLength
  DESC_CONFIG,                                        // bDescriptorType
  (LEN_CONFIG+LEN_INTERFACE+LEN_ENDPOINT*2), 0x00,    // wTotalLength
  0x01,                                               // bNumInterfaces
  0x01,                                               // bConfigurationValue
  0x00,                                               // iConfiguration
  0xC0,                                               // bmAttributes
  0x32,                                               // MaxPower

/* const BYTE cbyInterfaceDescriptor[LEN_INTERFACE] = */
  LEN_INTERFACE,  // bLength
  DESC_INTERFACE, // bDescriptorType
  0x00,     // bInterfaceNumber
  0x00,     // bAlternateSetting
  0x02,     // bNumEndpoints
  0x08,     // bInterfaceClass
  0x05,     // bInterfaceSubClass
  0x50,     // bInterfaceProtocol
  0x00,     // iInterface

/* const BYTE cbyEndpointDescriptor1[LEN_ENDPOINT] = */
  LEN_ENDPOINT,           // bLength
  DESC_ENDPOINT,          // bDescriptorType
  0x82,                   // bEndpointAddress
  EP_BULK,                // bmAttributes
  MAX_PACKET_SIZE, 0x00,  // wMaxPacketSize
  0x00,                   // bInterval

/* const BYTE cbyEndpointDescriptor2[LEN_ENDPOINT] = */
  LEN_ENDPOINT,           // bLength
  DESC_ENDPOINT,          // bDescriptorType
  0x03,                   // bEndpointAddress
  EP_BULK,                // bmAttributes
  MAX_PACKET_SIZE, 0x00,  // wMaxPacketSize
  0x00                    // bInterval
};

const uint8_t MassStringDescriptor0[4] =
{
  4,            // bLength
  DESC_STRING,  // bDescriptorType
  0x09, 0x04
};

const uint8_t MassStringDescriptor1[16] =
{
  16,           // bLength
  DESC_STRING,  // bDescriptorType
  'N', 0, 'u', 0, 'v', 0, 'o', 0, 't', 0, 'o', 0, 'n', 0
};

const uint8_t InquiryID[36] = 
{
  0x00,         // Peripheral Device Type
  0x80,         // RMB
  0x00,         // ISO/ECMA, ANSI Version
  0x00,         // Response Data Format
  0x1F, 0x00, 0x00, 0x00, // Additional Length

  /* Vendor Identification */
  'N', 'u', 'v', 'o', 't', 'o', 'n', ' ',

  /* Product Identification */
  '1', '0', '0', ' ', 'M', 'a', 's', 's', ' ', 'S', 't', 'o', 'r', 'a', 'g', 'e',

  /* Product Revision */
  '1', '.', '0', '0'
};


static __INLINE uint32_t get_be32(uint8_t *buf)
{
  return ((uint32_t) buf[0] << 24) | ((uint32_t) buf[1] << 16) |
      ((uint32_t) buf[2] << 8) | ((uint32_t) buf[3]);
}

void RoughDelay(uint32_t t)
{
    volatile int32_t delay;

    delay = t;

    while(delay-- >= 0);
}

void my_memcpy(void *dest, void *src, int32_t size)
{
    int32_t i;

    for (i = 0; i < size; i++)
       *((uint8_t *)dest + i) = *((uint8_t *)src + i);
}


void ModeSenseCommand(void)
{
  uint8_t i,j;
  uint8_t NumHead,NumSector;
  uint16_t NumCyl = 0;

  /* Clear the command buffer */
  *((uint32_t *)MassCMD_BUF  ) = 0;
  *((uint32_t *)MassCMD_BUF + 1) = 0;

  switch (g_sCBW.au8Data[0])
  {
    case 0x01:
    {
      outpb(MassCMD_BUF, 19);
      i = 8;
      for (j = 0; j<12; j++, i++)
        outpb(MassCMD_BUF+i, ModePage_01[j]);
      break;
    }
    case 0x05:
    {
      outpb(MassCMD_BUF, 39);
      i = 8;
      for(j = 0; j<32; j++, i++)
        outpb(MassCMD_BUF+i, ModePage_05[j]);
      
