teamjft/NUVOTON-NUC200/NUC200Series_sample/SampleCode/USB/UDC/MassStorage.c
      NumHead = 2;
      NumSector = 64;
        
      if (g_sCBW.bCBWLUN==F_DATA_FLASH_LUN)
        NumCyl = g_dataFlashTotalSectors/128;

      outpb(MassCMD_BUF+12, NumHead);
      outpb(MassCMD_BUF+13, NumSector);
      outpb(MassCMD_BUF+16, (uint8_t)(NumCyl >> 8));
      outpb(MassCMD_BUF+17, (uint8_t)(NumCyl & 0x00ff));
      break;
    }
    case 0x1B:
    {
      outpb(MassCMD_BUF, 19);
      i = 8;
      for (j = 0; j<12; j++, i++)
        outpb(MassCMD_BUF+i, ModePage_1B[j]);
      break;
    }
    case 0x1C:
    {
      outpb(MassCMD_BUF, 15);
      i = 8;
      for (j = 0; j<8; j++, i++)
        outpb(MassCMD_BUF+i, ModePage_1C[j]);
      break;
    }
    case 0x3F:
    {
      outpb(MassCMD_BUF, 0x47);
      i = 8;
      for (j = 0; j<12; j++, i++)
        outpb(MassCMD_BUF+i, ModePage_01[j]);
      for (j = 0; j<32; j++, i++)
        outpb(MassCMD_BUF+i, ModePage_05[j]);
      for (j = 0; j<12; j++, i++)
        outpb(MassCMD_BUF+i, ModePage_1B[j]);
      for (j = 0; j<8; j++, i++)
        outpb(MassCMD_BUF+i, ModePage_1C[j]);
      
      NumHead = 2;
      NumSector = 64;

      if (g_sCBW.bCBWLUN==F_DATA_FLASH_LUN)
        NumCyl = g_dataFlashTotalSectors/128;

      outpb(MassCMD_BUF+24, NumHead);
      outpb(MassCMD_BUF+25, NumSector);
      outpb(MassCMD_BUF+28, (uint8_t)(NumCyl >> 8));
      outpb(MassCMD_BUF+29, (uint8_t)(NumCyl & 0x00ff));
      break;
    }
    default:
      g_au8SenseKey[0] = 0x05;
      g_au8SenseKey[1] = 0x24;
      g_au8SenseKey[2] = 0x00;
  }
}


void ReqSenCommand(void)
{
    uint8_t tmp[20];
    
    if (preventflag==1)
    {
        preventflag=0;
    tmp[0] = 0x70;
    }
    else
    tmp[0] = 0xf0;

  tmp[1] = 0;
  tmp[3] = 0;
  tmp[4] = 0;
  tmp[5] = 0;
  tmp[6] = 0;
  tmp[7] = 0x0A;
  tmp[8] = 0;
  tmp[9] = 0;
  tmp[10] = 0;
  tmp[11] = 0;
  tmp[14] = 0;
  tmp[15] = 0;
  tmp[16] = 0;
  tmp[17] = 0;

  tmp[2] = g_au8SenseKey[0];
  tmp[12] = g_au8SenseKey[1];
  tmp[13] = g_au8SenseKey[2];

    my_memcpy(g_au8UsbBulk1, tmp, 20);
  
  // Sense Key
  g_au8SenseKey[0] = 0x00;
  g_au8SenseKey[1] = 0x00;
  g_au8SenseKey[2] = 0x00;
}


void RdFmtCapCommand(void)
{
    uint32_t i;
    uint32_t TotalSectors = 0;

  for (i = 0; i < 36; i++)
    outpb(MassCMD_BUF+i, 0);

  outpb(MassCMD_BUF+3, 0x10);

    if (g_sCBW.bCBWLUN==F_DATA_FLASH_LUN)
    TotalSectors = g_dataFlashTotalSectors;

  outpb(MassCMD_BUF+4, *((uint8_t *)&TotalSectors+3));
  outpb(MassCMD_BUF+5, *((uint8_t *)&TotalSectors+2));
  outpb(MassCMD_BUF+6, *((uint8_t *)&TotalSectors+1));
  outpb(MassCMD_BUF+7, *((uint8_t *)&TotalSectors+0));
  outpb(MassCMD_BUF+8, 0x02);
  outpb(MassCMD_BUF+10, 0x02);
  outpb(MassCMD_BUF+12, *((uint8_t *)&TotalSectors+3));
  outpb(MassCMD_BUF+13, *((uint8_t *)&TotalSectors+2));
  outpb(MassCMD_BUF+14, *((uint8_t *)&TotalSectors+3));
  outpb(MassCMD_BUF+15, *((uint8_t *)&TotalSectors+0));
  outpb(MassCMD_BUF+18, 0x02);
}


void RdCurCapCommand(void)
{
    int i;
    uint32_t temp;

  for (i = 0; i < 36; i++)
    outpb(MassCMD_BUF+i, 0);

    if (g_sCBW.bCBWLUN==F_DATA_FLASH_LUN)
        temp = g_dataFlashTotalSectors - 1;

  outpb(MassCMD_BUF+0, *((uint8_t *)&temp+3));
  outpb(MassCMD_BUF+1, *((uint8_t *)&temp+2));
  outpb(MassCMD_BUF+2, *((uint8_t *)&temp+1));
  outpb(MassCMD_BUF+3, *((uint8_t *)&temp+0));
  outpb(MassCMD_BUF+6, 0x02);
}


//======================================================
// USB Configuration
//======================================================
void UsbCfg(void)
{
    /* Init the USB device address to 0x0 */
    _USBD_SET_FADDR(0x00);

    /* Init control end point */
    USBD->STBUFSEG = 248;                         /* Buffer for setup packet */
    _USBD_SET_CFG_EP0(EPT_CFGP);                /* Clear EP0 CTRL IN Ready Flag */
    _USBD_SET_CFG(0, CFG0_SETTING);             /* EP0 ==> control IN end point, address 0 */
    _USBD_SET_EP_BUF(0, USBD_SRAM_BASE + BUF0_SETTING);  /* Buffer for EP0 */
    _USBD_SET_CFG_EP1(EPT_CFGP);                /* Clear EP1 CTRL OUT Ready Flag */
    _USBD_SET_CFG(1, CFG1_SETTING);             /* EP1 ==> control OUT end point, address 0 */
    _USBD_SET_EP_BUF(1, USBD_SRAM_BASE + BUF1_SETTING);    /* Buffer for EP1 */
    
    /* Init Bulk IN end point */
    _USBD_SET_CFG_EP2(EPT_CFGP);                /* Clear EP2 BULK IN Ready Flag */
    _USBD_SET_CFG(2, CFG2_SETTING);             /* EP2 ==> Bulk IN end point, address 2 */
    _USBD_SET_EP_BUF(2, USBD_SRAM_BASE + BUF_BULK1);     /* Buffer for EP2 (Bulk IN) */  
  
    /* Init Bulk OUT end point */
    _USBD_SET_CFG_EP3(EPT_CFGP);                /* Clear EP3 BULK OUT Ready Flag */
    _USBD_SET_CFG(3, CFG3_SETTING);             /* EP3 ==> Bulk OUT end point, address 3 */
    _USBD_SET_EP_BUF(3, USBD_SRAM_BASE + BUF_BULK0);   /* Buffer for EP3 (Bulk OUT) */
  
    g_u8Address = 0;    /* Device address */
    g_u8Config = 0;
    g_u8Flag = 0;       /* Flag to record the USB request */
    
    g_u8BulkState = BULK_CBW;
    g_au8SenseKey[0] = 0;
    g_au8SenseKey[1] = 0;
    g_au8SenseKey[2] = 0;
    g_bCBWInvalid = FALSE;
    
    g_u32Address = 0;
    g_u32Length = 0;
    g_u8Size = 0;
    
    g_sCSW.dCSWSignature = CSW_SIGNATURE;
    
    udcOnLine = 0;
    g_u32OutToggle = 0; // for Error Detection
}

//======================================================
// USB Floating Detect
//======================================================
void UsbFdt(void)
{
    uint8_t u8FLDET = USBD->FLDET;

    _USBD_SET_EVENT_FLAG(INTSTS_FLDET);
  
    if (u8FLDET)
    {
        /* USB Plug In */

        if(g_u8UsbState & USB_STATE_ATTACHED)
        {
          /* Do nothing if it is already attached */
          return;
        }
    
        /* Update USB state */
        g_u8UsbState = USB_STATE_ATTACHED;

        /* Init the end points */
        UsbCfg();
    
        /* Enable USB and enable PHY */
        _USBD_ENABLE_USB();
    }
    else
    {
        /* USB Un-plug */
  
        /* Update USB state */
        g_u8UsbState = USB_STATE_DETACHED;
    
