teamjft/NUVOTON-NUC200/NUC200Series_sample/SampleCode/USB/UDC/MassStorage.c
        udcOnLine = 0;
    
        /* Disable USB, Disable remote weak up, and disable PHY */
        _USBD_DISABLE_USB();
    }
}


//======================================================
// USB Bus Event
//======================================================
void UsbBus(void)
{
    uint8_t u8ATTR = *((__IO uint32_t *)(&USBD->ATTR)) & 0xFF;
    
    /* Clear event flag */
    _USBD_SET_EVENT_FLAG(INTSTS_BUS);
    
    /* Just return if USB detached. */
    if (g_u8UsbState == USB_STATE_DETACHED)
        return;
  
    /* Process USB bus command if USB is attached. */
    if (u8ATTR & ATTR_USBRST)
    { 
        /* Enable USB and enable PHY */
        _USBD_ENABLE_USB();   
      
        /* Enter default state */
        g_u8UsbState = USB_STATE_DEFAULT;
      
        /* Configure the end-points */
        UsbCfg();
    }
    else if (u8ATTR & ATTR_SUSPEND)
    { 
        /* Enable USB but disable PHY */
        _USBD_DISABLE_PHY();
      
        /* Update the USB state */
        g_u8UsbState |= USB_STATE_FLAG_SUSPENDED;
    }
    else if (u8ATTR & ATTR_RESUME)
    {
        /* Enable USB and enable PHY */
        _USBD_ENABLE_USB();
      
        /* Clear the suspend state */
        g_u8UsbState &= ~USB_STATE_FLAG_SUSPENDED;
    }
}


//======================================================
int32_t UsbStdReq(void)
{
  int volatile len, idx;
    uint8_t tmp[8];
    
    my_memcpy(tmp, g_au8UsbSetup, 8);
    
  /* check if after DEFAULT state (RESET) */
  if ((g_u8UsbState & USB_STATE_FLAG_DEFAULT) == 0x00)
    return FALSE;

  /* parse the request in setup packet */ 
    switch (tmp[1])
  {
    case GET_DESCRIPTOR:
    {
      len = tmp[6] + ((uint32_t)tmp[7] << 8);
            
      switch (tmp[3])
            {
        // Get Device Descriptor
        case DESC_DEVICE:
        {
          udcOnLine = 1;

          if (len > LEN_DEVICE)
              len = LEN_DEVICE;

                    my_memcpy(g_au8UsbCtrl, (void *)MassDeviceDescriptor, len);
          break;
        }
        // Get Configuration Descriptor
        case DESC_CONFIG:
        {
          if (len > MassConfigurationBlock[2])
              len = MassConfigurationBlock[2];
          
          my_memcpy(g_au8UsbCtrl, (void *)MassConfigurationBlock, len);                   
                    break;
        }
        // Get String Descriptor
        case DESC_STRING:
        {
          // Get Language
          if(tmp[4] == 0)
                    {
            if(len > MassStringDescriptor0[0])
                len = MassStringDescriptor0[0];
            
            my_memcpy(g_au8UsbCtrl, (void *)MassStringDescriptor0, len);
                        
                        break;
          }
          // Get String Descriptor
          if(len > MassStringDescriptor1[0])
              len = MassStringDescriptor1[0];
                    
          my_memcpy(g_au8UsbCtrl, (void *)MassStringDescriptor1, len);
                    
                    break;
        }
        default:
          return FALSE;
      }
      _USBD_SET_CFG(0, DATA1 (CFG0_SETTING));
      _USBD_TRIG_EP(0, len);
      g_u8Flag = FLAG_OUT_ACK;
      return TRUE;
    }
    case SET_ADDRESS:
    {
        /* Accept set address command only before USB configured */
      if((g_u8UsbState & USB_STATE_FLAG_CONFIGURED) == 0)
      {
        /* Get the device address */
        g_u8Address = tmp[2];
                
        _USBD_SET_CFG(0, DATA1 (CFG0_SETTING));
        _USBD_TRIG_EP(0, 0);
        g_u8Flag = FLAG_SET_ADDRESS;
        return TRUE;
      }
      return FALSE;
    }
    case SET_CONFIGURATION:
    {
      g_u8Config = tmp[2];
            
      _USBD_SET_CFG(0, DATA1 (CFG0_SETTING));
      _USBD_TRIG_EP(0, 0);
      g_u8Flag = FLAG_SET_CONFIG;
      return TRUE;
    }
    case CLEAR_FEATURE:
    case SET_FEATURE:
    {
      if (g_bCBWInvalid)
      {
            /* Invalid CBW */
      }
      else if((tmp[0] == 2) && (tmp[2] == FEATURE_ENDPOINT_HALT))
            {
        uint32_t u32CfgAddr;
                uint8_t  u8Cfg;

                u32CfgAddr = ((tmp[4] & 0xF) << 4) + USBD_CFGP0;
                
        u8Cfg = *((__IO uint32_t *) (u32CfgAddr)) & 0xFF;
        
        if(tmp[1] == CLEAR_FEATURE)
                  u8Cfg &= ~EPT_stall;
        else
          u8Cfg |= EPT_stall;
        *((__IO uint32_t *) (u32CfgAddr)) = u8Cfg;
      }
      else
        return FALSE;
        
      _USBD_SET_CFG(0, DATA1 (CFG0_SETTING));
      _USBD_TRIG_EP(0, 0);
      return TRUE;
    }
    case GET_CONFIGURATION:
    {
      g_au8UsbCtrl[0] = g_u8Config;
            
      _USBD_SET_CFG(0, DATA1(CFG0_SETTING));
      _USBD_TRIG_EP(0, 1);
      g_u8Flag = FLAG_OUT_ACK;
      return TRUE;
    }
    case GET_STATUS:
    {
            uint8_t u8Data;

            u8Data = tmp[0];
      // Device
      if (u8Data == 0x80)
              g_au8UsbCtrl[0] = 1;  // Self-Powered
      
      // Interface
      else if (u8Data == 0x81)
              g_au8UsbCtrl[0] = 0;
      
      // Endpoint
      else if (u8Data == 0x82)
            {
                uint32_t u32CfgAddr;
                u8Data = tmp[4];
                u32CfgAddr = ((u8Data & 0xF) << 4) + USBD_CFGP0;

        g_au8UsbCtrl[0] = (inp32(u32CfgAddr) >> 1) & 1;
      }
      else
        return FALSE;
        
            g_au8UsbCtrl[1] = 0;

      _USBD_SET_CFG(0, DATA1 (CFG0_SETTING));
      _USBD_TRIG_EP(0, 1);
      g_u8Flag = FLAG_OUT_ACK;
      return TRUE;
    }
    case GET_INTERFACE:
    {
      g_au8UsbCtrl[0] = 0;

      _USBD_SET_CFG(0, DATA1(CFG0_SETTING));
      _USBD_TRIG_EP(0, 1);
      g_u8Flag = FLAG_OUT_ACK;
      return TRUE;
    }
    case SET_INTERFACE:
    {
      g_u8Flag = FLAG_SET_INTERFACE;

      _USBD_SET_CFG(0, DATA1(CFG0_SETTING));
      _USBD_TRIG_EP(0, 0);
      return TRUE;
    }
    default:
      return FALSE;
  }
}


//======================================================
int32_t UsbClassReq(void)
{
    uint8_t tmp[8];

    my_memcpy(tmp, g_au8UsbSetup, 8);
    
  if ((tmp[2] != 0) || (tmp[3] != 0) || (tmp[4] != 0) || (tmp[5] != 0))
      return FALSE;

  switch(tmp[1])
    {
    // Bulk-Only Mass Storage Reset
    case BULK_ONLY_MASS_STORAGE_RESET:
    {
      if ((tmp[6] != 0) || (tmp[7] != 0))
              return FALSE;
      g_bCBWInvalid = FALSE;

      _USBD_SET_CFG(0, DATA1 (CFG0_SETTING));
      _USBD_TRIG_EP(0, 0);
      _USBD_SET_CFG(2, DATA0 (CFG2_SETTING));
      
      g_u8BulkState = BULK_CBW;
      _USBD_TRIG_EP(3, 31);
      return TRUE;
    }
    // Get Max LUN
    case GET_MAX_LUN:
    {
            if ((tmp[6] != 1) || (tmp[7] != 0))
        return FALSE;
      g_au8UsbCtrl[0] = MassLUN - 1;
            if (MassLUN != 1)
                while(1);
            
      _USBD_SET_CFG(0, DATA1(CFG0_SETTING));
      _USBD_SET_CFG(3, DATA0(CFG3_SETTING));
      _USBD_TRIG_EP(0, 1);
      
