teamjft/NUVOTON-NUC200/NUC200Series_sample/SampleCode/USB/UDC/MassStorage.c
      g_u8Flag = FLAG_OUT_ACK;
      return TRUE;
    }
  }
  return FALSE;
}


//======================================================
int32_t UsbSetup(void)
{
    /* Clear the data IN/OUT ready flag of control end-points */
  _USBD_SET_CFG_EP0(CFGP_CLRRDY); 
  _USBD_SET_CFG_EP1(CFGP_CLRRDY);
  
  /* USB device request in setup packet: offset 0, D[6..5]: 0=Stardard, 1=Class, 2=Vendor, 3=Reserved */
  switch (g_au8UsbSetup[0] & 0x60)
  {
    case REQ_STANDARD:
      return UsbStdReq();
    case REQ_CLASS:
      return UsbClassReq();
    default:
      return FALSE;
  }
}


//======================================================
void UsbInAck(void)
{
  switch (g_u8Flag)
  {
    // Out ACK
    case FLAG_OUT_ACK:
      _USBD_TRIG_EP(1, 0);
      break;
    // Set Address
    case FLAG_SET_ADDRESS:
    {
      if (g_u8Address == 0)
        g_u8UsbState = USB_STATE_DEFAULT;
      else
        g_u8UsbState = USB_STATE_ADDRESS;
      
      _USBD_SET_FADDR(g_u8Address);
      break;
    }
    // Set Interface
    case FLAG_SET_INTERFACE:
    // Set Configuration
    case FLAG_SET_CONFIG:
    {
      if (g_u8Config == 0)
        g_u8UsbState = USB_STATE_ADDRESS;
      else
      {
        g_u8UsbState = USB_STATE_CONFIGURED;
        // ---------------------------------
        _USBD_SET_CFG(2, DATA0 (CFG2_SETTING));
        _USBD_TRIG_EP(3, 31);
        // ---------------------------------
      }
      break;
    }
    // Get Max. LUN
    case FLAG_GET_MAX_LUN:
      _USBD_TRIG_EP(1, 0);
      return;
    default:
      return;
  }
  g_u8Flag = 0;
}

//======================================================
void UsbOutAck(void)
{
  switch (g_u8Flag)
  {
    // Get Max. LUN
    case FLAG_GET_MAX_LUN:
    {
      // ---------------------------------
      _USBD_SET_CFG(2, DATA0 (CFG2_SETTING));
      _USBD_TRIG_EP(3, 31);
      // ---------------------------------
      break;
    }
    default:
      return;
  }
  g_u8Flag = 0;
}


//======================================================
void UsbRead(void)
{
    uint32_t u32Len;
    
  /* DATA0/DATA1 Toggle */
  if (*((__IO uint32_t *)(&USBD->EP[2].BUFSEG)) == BUF_BULK1)
    _USBD_SET_EP_BUF(2, USBD_SRAM_BASE + BUF_BULK0);
  else
    _USBD_SET_EP_BUF(2, USBD_SRAM_BASE + BUF_BULK1);
    
  /* Trigger to send out the data packet */ 
  _USBD_TRIG_EP(2, g_u8Size);
  
  g_u32Length -= g_u8Size;
  g_u32BytesInStorageBuf -= g_u8Size;

    if (g_u32Length)
    {
        if (g_u32BytesInStorageBuf)
        {
          /* Prepare next data packet */
          g_u8Size = MAX_PACKET_SIZE;
          if (g_u8Size > g_u32Length)
              g_u8Size = g_u32Length;

          if (*((__IO uint32_t *)(&USBD->EP[2].BUFSEG)) == BUF_BULK1)
          {
            my_memcpy(g_au8UsbBulk0, (int8_t *)g_u32Address, g_u8Size);
          }
          else
          {
            my_memcpy(g_au8UsbBulk1, (int8_t *)g_u32Address, g_u8Size);
          }
          g_u32Address += g_u8Size;
      }
      else
      {
        u32Len = g_u32Length;
        if (u32Len > STORAGE_BUFFER_SIZE)
            u32Len = STORAGE_BUFFER_SIZE;
        
      DataFlashRead(g_u32LbaAddress, u32Len, (uint32_t)STORAGE_DATA_BUF);
        g_u32BytesInStorageBuf = u32Len;
        g_u32LbaAddress += u32Len;
            g_u32Address = STORAGE_DATA_BUF;        
        
          /* Prepare next data packet */
          g_u8Size = MAX_PACKET_SIZE;
          if (g_u8Size > g_u32Length)
              g_u8Size = g_u32Length;

          if (*((__IO uint32_t *)(&USBD->EP[2].BUFSEG)) == BUF_BULK1)
          {
            my_memcpy(g_au8UsbBulk0, (int8_t *)g_u32Address, g_u8Size);
          }
          else
          {
            my_memcpy(g_au8UsbBulk1, (int8_t *)g_u32Address, g_u8Size);
          }
          g_u32Address += g_u8Size;       
      }
  }
}


void UsbReadTrig(void)
{
    uint32_t u32Len;
    
    if (g_u32Length)
    {
        if (g_u32BytesInStorageBuf)
        {
          /* Prepare next data packet */
          g_u8Size = MAX_PACKET_SIZE;
          if (g_u8Size > g_u32Length)
              g_u8Size = g_u32Length;

          if (*((__IO uint32_t *)(&USBD->EP[2].BUFSEG)) == BUF_BULK1)
          {
            my_memcpy(g_au8UsbBulk0, (int8_t *)g_u32Address, g_u8Size);
          }
          else
          {
            my_memcpy(g_au8UsbBulk1, (int8_t *)g_u32Address, g_u8Size);
          }
          g_u32Address += g_u8Size;
      }
      else
      {
        u32Len = g_u32Length;
        if (u32Len > STORAGE_BUFFER_SIZE)
            u32Len = STORAGE_BUFFER_SIZE;
        
      DataFlashRead(g_u32LbaAddress, u32Len, (uint32_t)STORAGE_DATA_BUF);
        g_u32BytesInStorageBuf = u32Len;
        g_u32LbaAddress += u32Len;
            g_u32Address = STORAGE_DATA_BUF;        
        
          /* Prepare next data packet */
          g_u8Size = MAX_PACKET_SIZE;
          if (g_u8Size > g_u32Length)
              g_u8Size = g_u32Length;

          if (*((__IO uint32_t *)(&USBD->EP[2].BUFSEG)) == BUF_BULK1)
          {
            my_memcpy(g_au8UsbBulk0, (int8_t *)g_u32Address, g_u8Size);
          }
          else
          {
            my_memcpy(g_au8UsbBulk1, (int8_t *)g_u32Address, g_u8Size);
          }
          g_u32Address += g_u8Size;       
      }
  
    /* DATA0/DATA1 Toggle */
    if (*((__IO uint32_t *)(&USBD->EP[2].BUFSEG)) == BUF_BULK1)
      _USBD_SET_EP_BUF(2, USBD_SRAM_BASE + BUF_BULK0);
    else
      _USBD_SET_EP_BUF(2, USBD_SRAM_BASE + BUF_BULK1);
    
    /* Trigger to send out the data packet */ 
    _USBD_TRIG_EP(2, g_u8Size);
  
    g_u32Length -= g_u8Size;
    g_u32BytesInStorageBuf -= g_u8Size;

  }
  else
    _USBD_TRIG_EP(2, 0);  
}


//======================================================
void UsbBulkInAck(void)
{
  int32_t volatile idx;

  if (g_u8BulkState == BULK_CSW)
  {
      /* Prepare to receive the CBW */
    g_u8BulkState = BULK_CBW;

    _USBD_SET_EP_BUF(3, USBD_SRAM_BASE + BUF_BULK0);
    _USBD_TRIG_EP(3, 31);
  }
  else if (g_u8BulkState == BULK_IN)
  {
    switch (g_sCBW.u8OPCode)
    {
      case UFI_READ_FORMAT_CAPACITY:
      case UFI_READ_CAPACITY:
      case UFI_MODE_SENSE_10:
      //case UFI_READ_10:
      {
        if (g_u32Length > 0)
        {
          UsbRead();
          return;
        }
      }
      case UFI_READ_10:
      {
        if (g_u32Length > 0)
        {
          //UsbRead();
          UsbReadTrig();
          return;
        }     
      }
      
