teamjft/NUVOTON-NUC200/NUC200Series_sample/SampleCode/USB/UDC/MassStorage.c
      case UFI_REQUEST_SENSE:
      case UFI_INQUIRY:
      {
        g_sCSW.dCSWDataResidue = 0;
        g_sCSW.bCSWStatus = 0;
        break;
      }

      case UFI_PREVENT_ALLOW_MEDIUM_REMOVAL:
      case UFI_VERIFY_10:
      case UFI_START_STOP:
      case UFI_WRITE_10:
      case VENDER_CMD:
      {
        int32_t tmp;
        
        tmp = g_sCBW.dCBWDataTransferLength - STORAGE_BUFFER_SIZE;
        if (tmp < 0) 
          tmp = 0;
        
        g_sCSW.dCSWDataResidue = tmp;
        g_sCSW.bCSWStatus = 0;
        break;
      }
      case UFI_TEST_UNIT_READY:
      {
        g_sCSW.dCSWDataResidue = 0;
        g_sCSW.bCSWStatus = 0;
        break;
      }
      default:
      {
          /* Unsupported commmand. Return command fail status */
        g_sCSW.dCSWDataResidue = g_sCBW.dCBWDataTransferLength;
        g_sCSW.bCSWStatus = 0x01;
        break;
      }
    }
    
    /* Return the CSW */
    _USBD_SET_EP_BUF(2, USBD_SRAM_BASE + BUF_BULK1);

        my_memcpy(g_au8UsbBulk1, &g_sCSW.dCSWSignature, 16);

    g_u8BulkState = BULK_CSW;
    _USBD_TRIG_EP(2, 13);
  }
}

//======================================================
void UsbWrite(void)
{
  uint32_t lba, len;

  if (g_u32Length > MAX_PACKET_SIZE)
  {
    if (*((__IO uint32_t *)(&USBD->EP[3].BUFSEG)) == BUF_BULK0)
    {
      _USBD_SET_EP_BUF(3, USBD_SRAM_BASE + BUF_BULK1);
      _USBD_TRIG_EP(3, MAX_PACKET_SIZE);
      my_memcpy((char *)g_u32Address, g_au8UsbBulk0, MAX_PACKET_SIZE);
    }
    else
    {
      _USBD_SET_EP_BUF(3, USBD_SRAM_BASE + BUF_BULK0);
      _USBD_TRIG_EP(3, MAX_PACKET_SIZE);
      my_memcpy((char *)g_u32Address, g_au8UsbBulk1, MAX_PACKET_SIZE);
    }
        
    g_u32Address += MAX_PACKET_SIZE;
    g_u32Length -= MAX_PACKET_SIZE;
    
    /* Buffer full. Writer it to storage first. */
    if (g_u32Address >= (STORAGE_DATA_BUF + STORAGE_BUFFER_SIZE))
    {
      if (g_sCBW.bCBWLUN==F_DATA_FLASH_LUN)
        DataFlashWrite(g_u32DataFlashStartAddr, STORAGE_BUFFER_SIZE, (uint32_t)STORAGE_DATA_BUF);
        
        g_u32Address = STORAGE_DATA_BUF;
        g_u32DataFlashStartAddr += STORAGE_BUFFER_SIZE;
    }
  }
  else
  {
    if (*((__IO uint32_t *)(&USBD->EP[3].BUFSEG)) == BUF_BULK0)
    {
      my_memcpy((char *)g_u32Address, g_au8UsbBulk0, g_u32Length);
    }
    else
    {
      my_memcpy((char *)g_u32Address, g_au8UsbBulk1, g_u32Length);
    }
    g_u32Address += g_u32Length;
    g_u32Length = 0;


    if (g_sCBW.u8OPCode == UFI_WRITE_10)
    {
      lba = get_be32(&g_sCBW.au8Data[0]);
      len = g_sCBW.dCBWDataTransferLength;

      if (g_sCBW.bCBWLUN==F_DATA_FLASH_LUN)
      {
          len = lba * UDC_SECTOR_SIZE + g_sCBW.dCBWDataTransferLength - g_u32DataFlashStartAddr;
          if (len)
          {
            DataFlashWrite(g_u32DataFlashStartAddr, len, (uint32_t)STORAGE_DATA_BUF);
        }
        }
    }

    g_u8BulkState = BULK_IN;
    UsbBulkInAck ();
  }
}


//======================================================
int32_t UsbBulkOutAck(void)
{
  uint8_t u8Len;
  int32_t i;

  if (g_u8BulkState == BULK_CBW)
  {
    u8Len = *((__IO uint32_t *)(&USBD->EP[3].MXPLD));
    
    /* Check Signature & length of CBW */
    if ((*(uint32_t *) g_au8UsbBulk0 != CBW_SIGNATURE) || (u8Len != 31))
    {
      return FALSE;
    }
    
    /* Get the CBW */
    for (i = 0; i < u8Len; i++)
      *((uint8_t *) (&g_sCBW.dCBWSignature) + i) = g_au8UsbBulk0[i];
      
    /* Prepare to echo the tag from CBW to CSW */
    g_sCSW.dCSWTag = g_sCBW.dCBWTag;
    
    /* Parse Op-Code of CBW */
    switch (g_sCBW.u8OPCode)
    {
      case UFI_PREVENT_ALLOW_MEDIUM_REMOVAL:
      {
        if (g_sCBW.au8Data[2] & 0x01)
        {
          g_au8SenseKey[0] = 0x05;  //INVALID COMMAND
          g_au8SenseKey[1] = 0x24;
          g_au8SenseKey[2] = 0;
          preventflag = 1;
        }
        else
          preventflag = 0;
        g_u8BulkState = BULK_IN;
        UsbBulkInAck ();
        return TRUE;
      }
      case UFI_VERIFY_10:
      case UFI_START_STOP:
      case UFI_TEST_UNIT_READY:
      {
        g_u8BulkState = BULK_IN;
        UsbBulkInAck ();
        return TRUE;
      }
      case UFI_REQUEST_SENSE:
      {
        ReqSenCommand();
        g_u8BulkState = BULK_IN;
        _USBD_TRIG_EP(2, 18);
        return TRUE;
      }
      case UFI_READ_FORMAT_CAPACITY:
      {
        if (g_u32Length == 0)
        {
          g_u32Length = g_sCBW.dCBWDataTransferLength;
          g_u32Address = MassCMD_BUF;
        }
        RdFmtCapCommand();
        g_u8BulkState = BULK_IN;
        if (g_u32Length > 0)
        {
          if (g_u32Length > MAX_PACKET_SIZE)
            g_u8Size = MAX_PACKET_SIZE;
          else
            g_u8Size = g_u32Length;

          my_memcpy(g_au8UsbBulk1, (char *)g_u32Address, g_u8Size);

          g_u32Address += g_u8Size;
          _USBD_SET_EP_BUF(2, USBD_SRAM_BASE + BUF_BULK0);
          UsbRead ();
        }
        else
          UsbBulkInAck ();
        return TRUE;
      }
      case UFI_READ_CAPACITY:
      {
        if (g_u32Length == 0)
        {
            g_u32Length = g_sCBW.dCBWDataTransferLength;
          g_u32Address = MassCMD_BUF;
        }
        
        RdCurCapCommand();
        g_u8BulkState = BULK_IN;
        if (g_u32Length > 0)
        {
          if (g_u32Length > MAX_PACKET_SIZE)
            g_u8Size = MAX_PACKET_SIZE;
          else
            g_u8Size = g_u32Length;

          my_memcpy(g_au8UsbBulk1, (char *)g_u32Address, g_u8Size);

          g_u32Address += g_u8Size;
          _USBD_SET_EP_BUF(2, USBD_SRAM_BASE + BUF_BULK0);
          UsbRead ();
        }
        else
          UsbBulkInAck ();
        return TRUE;
      }
      case UFI_MODE_SELECT_10:
      {
        g_u32Length = g_sCBW.dCBWDataTransferLength;
        g_u32Address = MassCMD_BUF;

        if (g_u32Length > 0)
        {
          _USBD_TRIG_EP(3, MAX_PACKET_SIZE);
          g_u8BulkState = BULK_OUT;
        }
        return TRUE;
      }
      case UFI_MODE_SENSE_10:
      {
        if (g_u32Length == 0)
        {
          g_u32Length = g_sCBW.dCBWDataTransferLength;
          g_u32Address = MassCMD_BUF;
        }
        
        ModeSenseCommand();
        g_u8BulkState = BULK_IN;
        if (g_u32Length > 0)
        {
          if (g_u32Length > MAX_PACKET_SIZE)
            g_u8Size = MAX_PACKET_SIZE;
          else
            g_u8Size = g_u32Length;
          my_memcpy(g_au8UsbBulk1, (char *)g_u32Address, g_u8Size);

